INSERT INTO messages (id, sender_id, receiver_id, ad_id, text, created_at) VALUES
(1, 1, 2, 5, 'привет, товар еще доступен?', NOW()),
(2, 2, 1, 5, 'да, доступен', NOW()),
(3, 1, 2, 5, 'можно посмотреть сегодня?', NOW()),
(4, 2, 1, 5, 'да, вечером удобно', NOW()),
(5, 1, 3, 18,'здравствуйте, интересует объявление', NOW()),
(6, 3, 1, 18, 'добрый день, задавайте вопросы', NOW()),
(7, 2, 3, 59,'вы еще продаете?', NOW()),
(8, 3, 2, 59, 'да, продаю', NOW()),
(9, 2, 3, 59, 'торг возможен?', NOW()),
(10, 3, 2, 59, 'небольшой да', NOW());

SELECT setval('messages_id_seq', (SELECT MAX(id) FROM messages));